tku-iarc/scara-robot/test.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F4
ProjectManager.MainLocation=Core/Src
USART2.IPParameters=VirtualMode,BaudRate
RCC.CortexFreq_Value=16000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F429ZITx
ADC1.ContinuousConvMode=ENABLE
Dma.USART2_TX.1.MemInc=DMA_MINC_ENABLE
USART1.BaudRate=1000000
RCC.PLLCLKFreq_Value=96000000
PC12.Signal=UART5_TX
PB14.GPIO_Label=LD3
RCC.PLLQCLKFreq_Value=48000000
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_USART2_UART_Init-USART2-false-HAL-true,5-MX_USART1_UART_Init-USART1-false-HAL-true,6-MX_UART4_Init-UART4-false-HAL-true,7-MX_ADC1_Init-ADC1-false-HAL-true,8-MX_UART5_Init-UART5-false-HAL-true
RCC.RTCFreq_Value=32000
PA0/WKUP.Signal=UART4_TX
PD6.Locked=true
PA6.GPIO_Label=hadc1
PC14/OSC32_IN.Mode=LSE-External-Oscillator
USART1.IPParameters=VirtualMode,BaudRate
Dma.USART2_TX.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
PinOutPanel.RotationAngle=0
ProjectManager.StackSize=0x400
Mcu.IP4=SYS
Mcu.IP5=UART4
Mcu.IP2=NVIC
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP3=RCC
Mcu.IP0=ADC1
Mcu.IP1=DMA
Mcu.UserConstants=
Dma.USART2_RX.0.Priority=DMA_PRIORITY_HIGH
Mcu.ThirdPartyNb=0
PH0/OSC_IN.Mode=HSE-External-Oscillator
Dma.USART2_RX.0.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
UART4.BaudRate=38400
Mcu.IPNb=9
RCC.I2SClocksFreq_Value=96000000
ProjectManager.PreviousToolchain=
PD4.Signal=USART2_RTS
RCC.VcooutputI2S=96000000
ADC1.Channel-2\#ChannelRegularConversion=ADC_CHANNEL_6
Dma.USART2_TX.1.Mode=DMA_NORMAL
PH1/OSC_OUT.Signal=RCC_OSC_OUT
Mcu.Pin6=PA6
NVIC.DMA2_Stream0_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.Pin7=PB14
Mcu.Pin8=PA9
Mcu.Pin9=PA10
RCC.VCOSAIOutputFreq_Value=49000000
RCC.AHBFreq_Value=16000000
Mcu.Pin0=PC14/OSC32_IN
Mcu.Pin1=PC15/OSC32_OUT
PD5.Mode=Asynchronous
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PH0/OSC_IN
Mcu.Pin3=PH1/OSC_OUT
Mcu.Pin4=PA0/WKUP
Mcu.Pin5=PA1
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=25000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.26.2
MxDb.Version=DB.6.0.21
ADC1.Rank-2\#ChannelRegularConversion=1
PA1.GPIOParameters=GPIO_Label
Dma.ADC1.2.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
ProjectManager.BackupPrevious=false
Dma.USART2_RX.0.MemDataAlignment=DMA_MDATAALIGN_BYTE
RCC.VCOInputFreq_Value=1000000
Dma.USART2_TX.1.Instance=DMA1_Stream6
File.Version=6
Dma.USART2_RX.0.Instance=DMA1_Stream5
Dma.ADC1.2.Direction=DMA_PERIPH_TO_MEMORY
PB7.Signal=GPIO_Output
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
SH.ADCx_IN6.ConfNb=1
PD3.Mode=CTS_RTS
PH1/OSC_OUT.Mode=HSE-External-Oscillator
Dma.RequestsNb=3
ProjectManager.HalAssertFull=false
ProjectManager.ProjectName=test
PD7.GPIO_Label=data_control
PB7.GPIO_Label=LD2
Mcu.Package=LQFP144
PA6.Signal=ADCx_IN6
Dma.USART2_RX.0.PeriphInc=DMA_PINC_DISABLE
USART2.VirtualMode=VM_ASYNC
Dma.USART2_RX.0.FIFOMode=DMA_FIFOMODE_DISABLE
PC14/OSC32_IN.Signal=RCC_OSC32_IN
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PA10.Signal=USART1_RX
UART5.IPParameters=VirtualMode,BaudRate
PB14.GPIOParameters=GPIO_Label
PD4.Mode=CTS_RTS
Dma.Request2=ADC1
Dma.Request1=USART2_TX
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
UART5.BaudRate=38400
PD6.Signal=USART2_RX
NVIC.DMA1_Stream6_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Dma.Request0=USART2_RX
PD5.Locked=true
ProjectManager.CustomerFirmwarePackage=
Dma.ADC1.2.Mode=DMA_NORMAL
PA6.GPIOParameters=GPIO_Label
PA0/WKUP.GPIOParameters=GPIO_Label
Dma.USART2_TX.1.Priority=DMA_PRIORITY_HIGH
ProjectManager.ProjectFileName=test.ioc
UART4.IPParameters=VirtualMode,BaudRate
PA10.Mode=Asynchronous
Mcu.PinsNb=19
Dma.USART2_TX.1.FIFOMode=DMA_FIFOMODE_DISABLE
ProjectManager.NoMain=false
SH.ADCx_IN6.0=ADC1_IN6,IN6
ADC1.IPParameters=Rank-2\#ChannelRegularConversion,master,Channel-2\#ChannelRegularConversion,SamplingTime-2\#ChannelRegularConversion,NbrOfConversionFlag,ContinuousConvMode
Dma.ADC1.2.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
PD3.Signal=USART2_CTS
Dma.USART2_RX.0.Direction=DMA_PERIPH_TO_MEMORY
PD7.Signal=GPIO_Output
ProjectManager.DefaultFWLocation=true
RCC.VCOSAIOutputFreq_ValueQ=12250000
PD5.Signal=USART2_TX
RCC.VCOSAIOutputFreq_ValueR=24500000
ProjectManager.DeletePrevious=true
UART5.VirtualMode=Asynchronous
PB14.Locked=true
UART4.VirtualMode=Asynchronous
PD6.Mode=Asynchronous
Dma.USART2_TX.1.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
NVIC.USART2_IRQn=true\:0\:0\:false\:false\:true\:true\:true
USART2.BaudRate=1000000
ADC1.SamplingTime-2\#ChannelRegularConversion=ADC_SAMPLETIME_3CYCLES
RCC.FamilyName=M
Dma.USART2_RX.0.Mode=DMA_NORMAL
PA9.Mode=Asynchronous
Dma.ADC1.2.MemInc=DMA_MINC_ENABLE
ProjectManager.TargetToolchain=STM32CubeIDE
NVIC.DMA1_Stream5_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PB7.GPIOParameters=GPIO_Label
PA9.Signal=USART1_TX
RCC.VcooutputI2SQ=96000000
Dma.ADC1.2.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
ProjectManager.RegisterCallBack=
PD7.Locked=true
PA1.Signal=UART4_RX
PA0/WKUP.Mode=Asynchronous
RCC.VCOI2SOutputFreq_Value=192000000
PB14.Signal=GPIO_Output
PD2.Mode=Asynchronous
PC12.Mode=Asynchronous
Dma.USART2_TX.1.PeriphInc=DMA_PINC_DISABLE
board=custom
RCC.VCOOutputFreq_Value=192000000
ProjectManager.LastFirmware=true
PH0/OSC_IN.Signal=RCC_OSC_IN
Dma.USART2_TX.1.Direction=DMA_MEMORY_TO_PERIPH
RCC.APB2Freq_Value=16000000
PA1.Mode=Asynchronous
MxCube.Version=6.2.1
VP_SYS_VS_Systick.Mode=SysTick
PA1.GPIO_Label=uart_rx
PA0/WKUP.GPIO_Label=uart4_tx
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.FreePins=false
RCC.IPParameters=AHBFreq_Value,APB1Freq_Value,APB2Freq_Value,CortexFreq_Value,FamilyName,HSE_VALUE,HSI_VALUE,I2SClocksFreq_Value,LSI_VALUE,PLLCLKFreq_Value,PLLQCLKFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SYSCLKFreq_VALUE,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIOutputFreq_Value,VCOSAIOutputFreq_ValueQ,VCOSAIOutputFreq_ValueR,VcooutputI2S,VcooutputI2SQ
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F429ZITx
Dma.USART2_RX.0.MemInc=DMA_MINC_ENABLE
RCC.RTCHSEDivFreq_Value=12500000
Dma.ADC1.2.Instance=DMA2_Stream0
ProjectManager.UnderRoot=true
Mcu.IP8=USART2
Mcu.IP6=UART5
Mcu.IP7=USART1
ProjectManager.CoupleFile=false
RCC.SYSCLKFreq_VALUE=16000000
Dma.ADC1.2.Priority=DMA_PRIORITY_LOW
ADC1.master=1
Dma.ADC1.2.PeriphInc=DMA_PINC_DISABLE
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC15/OSC32_OUT.Mode=LSE-External-Oscillator
USART1.VirtualMode=VM_ASYNC
ProjectManager.CompilerOptimize=6
ProjectManager.HeapSize=0x200
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin15=PD6
Mcu.Pin16=PD7
Dma.ADC1.2.FIFOMode=DMA_FIFOMODE_DISABLE
Mcu.Pin13=PD4
Mcu.Pin14=PD5
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB7
RCC.HSI_VALUE=16000000
Mcu.Pin18=VP_SYS_VS_Systick
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
ADC1.NbrOfConversionFlag=1
Mcu.Pin11=PD2
Mcu.Pin12=PD3
Mcu.Pin10=PC12
PB7.Locked=true
PC15/OSC32_OUT.Signal=RCC_OSC32_OUT
Dma.USART2_TX.1.MemDataAlignment=DMA_MDATAALIGN_BYTE
PD2.Signal=UART5_RX
RCC.APB1Freq_Value=16000000
Dma.USART2_RX.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
ProjectManager.DeviceId=STM32F429ZITx
PD7.GPIOParameters=GPIO_Label
ProjectManager.LibraryCopy=1
isbadioc=false
